{
  "en": {
    "home": {
      "description": "I’m Passakon, Experienced Full Stack Engineer with extensive expertise in backend development using Golang and frontend development with Vue.js/Nuxt.js. Proven track record in implementing DevOps practices and building scalable enterprise solutions. Strong focus on system architecture, code quality, and automated deployment pipelines.",
      "download": "Download",
      "work": "Work"
    },
    "uses": {
      "title": "Software I use, gadgets I love, and other things I recommend.",
      "intro": "I get asked a lot about the things I use to build software, stay productive, or buy to fool myself into thinking I'm being productive when I'm really just procrastinating. Here's a big list of all of my favorite stuff.",
      "sections": {
        "dev": {
          "title": "Development & Work Software",
          "tools": {
            "intellij": {
              "title": "IntelliJ IDEA",
              "description": "The ultimate IDE for development. The intelligent code completion and powerful refactoring tools have dramatically improved my coding efficiency. The integrated debugging tools and Git management make it an indispensable part of my workflow."
            },
            "zsh": {
              "title": "zsh + gitbash",
              "description": "This combination gives me the best of both worlds on Windows. zsh's customization and plugins make terminal work a joy, while gitbash ensures seamless Git operations. The time saved with aliases and command completion is invaluable."
            },
            "k8s": {
              "title": "K8s Lens",
              "description": "Makes Kubernetes management visual and intuitive. The ability to see cluster health at a glance and troubleshoot issues directly from the GUI has saved me countless hours of command-line work."
            },
            "slack": {
              "title": "Slack",
              "description": "Essential for team communication and collaboration. The ability to quickly share code snippets, integrate with development tools, and organize discussions in threads makes it perfect for remote work. The search functionality has saved me countless times when looking for past solutions."
            },
            "figma": {
              "title": "Figma",
              "description": "Essential for design collaboration. Being able to inspect design elements and export assets directly makes frontend implementation much smoother. The real-time collaboration features are fantastic for team discussions."
            },
            "edge": {
              "title": "Microsoft Edge",
              "description": "Surprisingly became my go-to browser. The memory management is excellent, and the dev tools are powerful. Chrome extension compatibility means I don't miss out on any tools I need."
            }
          }
        },
        "workstation": {
          "title": "Workstation Hardware",
          "tools": {
            "windows": {
              "title": "Windows 11 Pro + i7-13700KF",
              "description": "My powerhouse workstation. This CPU handles everything I throw at it - multiple Docker containers, VMs, and heavy IDEs all running simultaneously without breaking a sweat. WSL2 support makes development on Windows a dream."
            },
            "gpu": {
              "title": "NVIDIA RTX 4080",
              "description": "This combination ensures I never have to wait for anything. The GPU accelerates ML tasks and provides buttery-smooth multi-monitor performance, while the RAM gives me plenty of headroom for all my development environments."
            },
            "keyboard": {
              "title": "Keychron Q1",
              "description": "The perfect mechanical keyboard for long coding sessions. The build quality is exceptional, and the typing experience is unmatched. Full customization means it's set up exactly how I like it."
            },
            "mouse": {
              "title": "Logitech G PRO X 2 Superlight",
              "description": "Incredibly precise and comfortable mouse. The wireless performance is flawless, and the battery life is remarkable. Perfect balance of gaming performance and professional use."
            },
            "lamp": {
              "title": "Xiaomi Mi LED Desk Lamp",
              "description": "Smart desk lamp that provides excellent illumination for long coding sessions. The adjustable color temperature and brightness help reduce eye strain. The minimalist design keeps my workspace clean, and the app control is surprisingly useful."
            }
          }
        },
        "audio": {
          "title": "Audio Setup",
          "tools": {
            "speakers": {
              "title": "Audioengine A2+ with S8 Subwoofer",
              "description": "This combination delivers incredible sound quality. The A2+ provides crystal clear mids and highs, while the S8 subwoofer adds deep, rich bass without being overwhelming. Perfect for both music and gaming."
            },
            "dac": {
              "title": "Sound Blaster X4",
              "description": "Versatile DAC/Amp that transformed my audio experience. The virtual surround sound and customizable EQ settings make both music and gaming more immersive. The mic processing features ensure clear communication."
            },
            "mic": {
              "title": "HyperX QuadCast",
              "description": "Professional-grade USB microphone with excellent sound quality. The tap-to-mute feature and visual mute indicator are incredibly convenient for meetings. The built-in shock mount ensures clean audio without vibration noise."
            }
          }
        },
        "coffee": {
          "title": "Coffee & Beverages",
          "tools": {
            "flair": {
              "title": "Flair 58",
              "description": "My dedicated espresso maker for when I want the perfect shot. The level of control over pressure and temperature lets me dial in exactly the right extraction. The manual process is therapeutic, and the results rival commercial machines costing many times more."
            },
            "grinder": {
              "title": "Fellow Opus",
              "description": "My go-to grinder for all brewing methods. The precision burrs and digital control ensure consistent grind size every time. Whether it's fine for espresso or coarse for cold brew, it delivers exactly what I need for the perfect cup."
            },
            "staresso": {
              "title": "Staresso Mirage SP300",
              "description": "An elegant lever machine that brings art to espresso making. The transparent design lets me watch the extraction process, while the pressure control helps me achieve that perfect crema. It's become an essential part of my coffee ritual."
            },
            "pourover": {
              "title": "Pour Over Dripper",
              "description": "For those mornings when I want a cleaner, brighter cup. The pour-over method brings out the subtle flavors in light roasts. The ritual of hand dripping is my favorite way to start a focused work day."
            }
          }
        }
      }
    },
    "projects": {
      "title": "Building tools and applications that solve real problems.",
      "intro": "Over the years, I've worked on various development projects focusing on performance, scalability, and user experience. Most of my work involves full-stack development, DevOps practices, and system architecture. Here are some projects that represent my journey and growth as a developer."
    },
    "speaking": {
      "title": "I've had the opportunity to speak at various tech events and meetups.",
      "intro": "I enjoy speaking at technical meetups as it allows me to share experiences and connect with fellow developers. These events have given me a platform to share knowledge while gaining new perspectives from others.",
      "sections": {
        "conference": "Conference & Meetup"
      },
      "appearances": {
        "experience": {
          "title": "Experience Stories",
          "description": "Shared real-world development experiences and career insights with computer science students, focusing on practical lessons and career preparation in the software industry.",
          "event": "CSCamp @KMITL"
        },
        "microfrontend": {
          "title": "มาลองดูซิ Micro-frontend เป็นไปได้จริงไหม?",
          "description": "Explored the possibilities and practical implementation of Micro-frontend architecture, discussing its benefits, challenges, and real-world applications in modern web development.",
          "event": "Vue.js Thailand Meetup #4"
        },
        "sentry": {
          "title": "Vue Error Logging to Sentry",
          "description": "Demonstrated effective error tracking and monitoring in Vue.js applications using Sentry, covering implementation strategies and best practices for production applications.",
          "event": "Vue.js Thailand Meetup #5"
        },
        "typescript": {
          "title": "Vue.js with TypeScript",
          "description": "Shared insights on integrating TypeScript with Vue.js, highlighting type safety benefits, development workflow improvements, and practical implementation techniques.",
          "event": "TypeScript Thailand Meetup #1"
        }
      }
    },
    "articles": {
      "title": "Writing about software development, system architecture, and tech experiences.",
      "intro": "All of my thoughts on full-stack development, DevOps practices, and software engineering experiences, collected in chronological order.",
      "read": "Read Article",
      "min_read": "min read"
    },
    "about": {
      "title": "I'm Passakon. Software Engineer & Full Stack Developer",
      "intro": {
        "p1": "With over 6 years of experience in software development, I've evolved from a Software developer to a technical specialist who bridges the gap between complex backend systems and intuitive frontend experiences. My journey has been driven by a constant desire to learn and master new technologies.",
        "p2": "Currently, I'm working as a Technical Specialist at Finema, where I develop enterprise-grade solutions and lead technical implementations. My role involves architecting scalable systems, developing core libraries, and establishing robust development practices."
      },
      "whatIDo": {
        "title": "What I Do",
        "intro": "I specialize in building full-stack applications with a focus on:",
        "skills": {
          "backend": "Developing scalable backend services using Golang and microservices architecture",
          "frontend": "Creating responsive and performant frontend applications with Vue.js and Nuxt.js",
          "devops": "Implementing DevOps practices with Docker, Kubernetes, and CI/CD pipelines",
          "database": "Designing and optimizing database structures and queries",
          "leadership": "Leading technical implementations and mentoring team members"
        }
      },
      "beyondCoding": {
        "title": "Beyond Coding",
        "content": "I believe in continuous learning and sharing knowledge with the developer community. When I'm not coding, I enjoy exploring new technologies, contributing to open-source projects, and staying updated with the latest industry trends."
      },
      "quote": "\"You're not untalented; you're just untrained.\" - This philosophy drives my approach to both personal growth and team development.",
      "connect": {
        "title": "Let's Connect",
        "content": "I'm always interested in discussing new opportunities, technical challenges, or just connecting with fellow developers. Feel free to reach out to me through"
      },
      "social": {
        "facebook": "Follow on Facebook",
        "instagram": "Follow on Instagram",
        "github": "Follow on GitHub",
        "linkedin": "Follow on LinkedIn"
      }
    },
    "menu": {
      "home": "Home",
      "about": "About",
      "articles": "Articles",
      "projects": "Projects",
      "speaking": "Speaking",
      "uses": "Uses"
    }
  },
  "th": {
    "home": {
      "description": "ผมภาสกร เป็น Full Stack Engineer ที่มีประสบการณ์และความเชี่ยวชาญในด้านการพัฒนา backend ด้วย Golang และการพัฒนา frontend ด้วย Vue.js/Nuxt.js และมีผลงานที่พิสูจน์แล้วในการนำแนวทาง DevOps มาใช้และสร้างโซลูชันระดับองค์กรที่สามารถขยายตัวได้ มุ่งเน้นด้านสถาปัตยกรรมระบบ คุณภาพโค้ด และระบบอัตโนมัติสำหรับการ deploy",
      "download": "ดาวน์โหลด",
      "work": "ประวัติการทำงาน"
    },
    "projects": {
      "title": "สร้างเครื่องมือและแอปพลิเคชันที่แก้ปัญหาจริง",
      "intro": "ตลอดระยะเวลาที่ผ่านมา ผมได้ทำงานในโครงการพัฒนาต่างๆ โดยมุ่งเน้นเรื่องประสิทธิภาพ ความสามารถในการ scale และประสบการณ์ผู้ใช้ งานส่วนใหญ่ของผมเกี่ยวข้องกับการพัฒนาแบบ fullstack การทำ DevOps และการออกแบบระบบ นี่คือบางโครงการที่แสดงถึงการการเติบโตของผมในฐานะนักพัฒนา"
    },
    "uses": {
      "title": "ซอฟต์แวร์ที่ผมใช้ อุปกรณ์ที่ผมชอบ และสิ่งอื่นๆ ที่ผมแนะนำ",
      "intro": "ผมมักถูกถามเกี่ยวกับสิ่งที่ใช้ในการพัฒนาซอฟต์แวร์ สิ่งที่ช่วยเพิ่มประสิทธิภาพ หรือสิ่งที่ซื้อมาเพื่อให้รู้สึกว่ากำลังทำงานอยู่ (ทั้งที่จริงๆ แค่กำลังผัดวันประกันพรุ่ง) นี่คือรายการทั้งหมดของสิ่งที่ผมชอบ",
      "sections": {
        "dev": {
          "title": "ซอฟต์แวร์สำหรับการพัฒนาและการทำงาน",
          "tools": {
            "intellij": {
              "title": "IntelliJ IDEA",
              "description": "IDE ที่ดีที่สุดสำหรับการพัฒนา ระบบเติมโค้ดอัตโนมัติและเครื่องมือปรับแต่งโค้ดช่วยเพิ่มประสิทธิภาพการทำงานของผมอย่างมาก เครื่องมือดีบั๊กและระบบจัดการ Git ทำให้มันเป็นส่วนสำคัญในการทำงานของผม"
            },
            "zsh": {
              "title": "zsh + gitbash",
              "description": "การผสมผสานที่ลงตัวบน Windows การปรับแต่งและปลั๊กอินของ zsh ทำให้การใช้งานเทอร์มินัลสนุก ส่วน gitbash ทำให้การใช้ Git ราบรื่น การประหยัดเวลาจากการใช้คำสั่งลัดและระบบเติมคำสั่งอัตโนมัตินั้นมีค่ามาก"
            },
            "k8s": {
              "title": "K8s Lens",
              "description": "ทำให้การจัดการ Kubernetes ง่ายขึ้นด้วยระบบ GUI ความสามารถในการดูสถานะคลัสเตอร์และแก้ไขปัญหาผ่านหน้าจอช่วยประหยัดเวลาการพิมพ์คำสั่งไปมากมาย"
            },
            "slack": {
              "title": "Slack",
              "description": "จำเป็นสำหรับการสื่อสารในทีม ทั้งการแชร์โค้ด เชื่อมต่อกับเครื่องมือพัฒนา และจัดการการสนทนาเป็นหมวดหมู่ เหมาะมากสำหรับการทำงานระยะไกล ระบบค้นหาช่วยผมหาข้อมูลเก่าๆ ได้หลายครั้ง"
            },
            "figma": {
              "title": "Figma",
              "description": "จำเป็นสำหรับการทำงานด้านดีไซน์ การดูรายละเอียดดีไซน์และดาวน์โหลดไฟล์ต่างๆ ทำให้การทำงานฝั่งหน้าบ้านง่ายขึ้น ฟีเจอร์ทำงานร่วมกันแบบเรียลไทม์เหมาะมากสำหรับการประชุมทีม"
            },
            "edge": {
              "title": "Microsoft Edge",
              "description": "กลายเป็นเบราว์เซอร์ที่ใช้ประจำอย่างไม่น่าเชื่อ จัดการแรมได้ดี เครื่องมือสำหรับนักพัฒนาก็มีประสิทธิภาพ ใช้ส่วนเสริมของ Chrome ได้ทำให้ไม่พลาดเครื่องมือที่ต้องการ"
            }
          }
        },
        "workstation": {
          "title": "อุปกรณ์คอมพิวเตอร์",
          "tools": {
            "windows": {
              "title": "Windows 11 Pro + i7-13700KF",
              "description": "คอมพิวเตอร์ทรงพลังของผม CPU นี้รับมือได้กับทุกงาน ทั้ง Docker หลายตัว เครื่องเสมือน และโปรแกรมพัฒนาที่หนักๆ ทำงานพร้อมกันได้สบายๆ WSL2 ทำให้การพัฒนาบน Windows สะดวกมาก"
            },
            "gpu": {
              "title": "NVIDIA RTX 4080",
              "description": "ทำให้การทำงานไม่มีสะดุด การ์ดจอช่วยเร่งงาน ML และรองรับการใช้หลายจอได้ลื่นไหล ส่วนแรมก็มีเพียงพอสำหรับงานพัฒนาทั้งหมด"
            },
            "keyboard": {
              "title": "Keychron Q1",
              "description": "คีย์บอร์ดกลที่สมบูรณ์แบบสำหรับการเขียนโค้ดยาวๆ คุณภาพการประกอบดีเยี่ยม ให้ความรู้สึกในการพิมพ์ที่ไม่มีใครเทียบ ปรับแต่งได้ทุกอย่างตามที่ต้องการ"
            },
            "mouse": {
              "title": "Logitech G PRO X 2 Superlight",
              "description": "เมาส์ที่แม่นยำและใช้สบาย ระบบไร้สายทำงานได้ดีเยี่ยม แบตอึดมาก เหมาะกับทั้งการเล่นเกมและการทำงาน"
            },
            "lamp": {
              "title": "Xiaomi Mi LED Desk Lamp",
              "description": "โคมไฟตั้งโต๊ะอัจฉริยะที่ให้แสงสว่างดีเยี่ยมสำหรับการทำงานนานๆ ปรับอุณหภูมิสีและความสว่างได้ช่วยถนอมสายตา ดีไซน์เรียบง่ายทำให้โต๊ะดูสะอาด ควบคุมผ่านแอพได้สะดวกดี"
            }
          }
        },
        "audio": {
          "title": "อุปกรณ์เสียง",
          "tools": {
            "speakers": {
              "title": "Audioengine A2+ พร้อม S8 Subwoofer",
              "description": "ชุดลำโพงที่ให้คุณภาพเสียงยอดเยี่ยม A2+ ให้เสียงกลางและเสียงแหลมที่ชัดเจน ส่วน S8 เสริมเสียงเบสที่ทรงพลังแต่ไม่มากเกินไป เหมาะกับทั้งฟังเพลงและเล่นเกม"
            },
            "dac": {
              "title": "Sound Blaster X4",
              "description": "DAC/Amp ที่เปลี่ยนประสบการณ์การฟังเสียงไปเลย ระบบเสียงรอบทิศทางและการปรับแต่ง EQ ทำให้ทั้งเพลงและเกมสมจริงขึ้น ระบบประมวลผลไมค์ช่วยให้เสียงสนทนาชัดเจน"
            },
            "mic": {
              "title": "HyperX QuadCast",
              "description": "ไมโครโฟน USB ระดับมืออาชีพที่ให้คุณภาพเสียงดีเยี่ยม ระบบแตะเพื่อปิดเสียงและไฟแสดงสถานะสะดวกมากสำหรับการประชุม ขาตั้งกันสั่นในตัวช่วยให้เสียงสะอาดไม่มีเสียงรบกวน"
            }
          }
        },
        "coffee": {
          "title": "กาแฟและเครื่องดื่ม",
          "tools": {
            "flair": {
              "title": "Flair 58",
              "description": "เครื่องชงเอสเพรสโซ่ที่ใช้เมื่อต้องการกาแฟที่สมบูรณ์แบบ การควบคุมแรงดันและอุณหภูมิช่วยให้ได้รสชาติที่ต้องการ การชงด้วยมือเป็นการบำบัดจิตใจ และผลลัพธ์สู้กับเครื่องระดับร้านค้าที่แพงกว่าหลายเท่าได้"
            },
            "grinder": {
              "title": "Fellow Opus",
              "description": "เครื่องบดกาแฟที่ใช้ได้กับทุกวิธีการชง ใบบดแบบพรีซิชั่นและระบบควบคุมดิจิทัลให้ขนาดการบดที่สม่ำเสมอทุกครั้ง ไม่ว่าจะบดละเอียดสำหรับเอสเพรสโซ่หรือหยาบสำหรับโคลด์บรูว์"
            },
            "staresso": {
              "title": "Staresso Mirage SP300",
              "description": "เครื่องชงระบบคันโยกที่สวยงาม ตัวเครื่องโปร่งใสให้เห็นกระบวนการสกัด ควบคุมแรงดันได้ช่วยให้ได้ครีมากาแฟที่สมบูรณ์แบบ กลายเป็นส่วนสำคัญในพิธีชงกาแฟของผม"
            },
            "pourover": {
              "title": "ดริปเปอร์",
              "description": "สำหรับเช้าที่อยากได้กาแฟที่สะอาดและสดชื่น วิธีดริปช่วยดึงรสชาติละเอียดอ่อนของกาแฟคั่วอ่อนออกมา พิธีการดริปด้วยมือเป็นวิธีที่ผมชอบที่สุดในการเริ่มวันทำงานที่ต้องใช้สมาธิ"
            }
          }
        }
      }
    },
    "speaking": {
      "title": "ผมได้มีโอกาสบรรยายในงานเทคโนโลยีและงาน Meetup ต่างๆ",
      "intro": "ผมชอบการพูดในงาน Meetup ด้านเทคนิค เพราะทำให้ผมได้แบ่งปันประสบการณ์และเชื่อมต่อกับเพื่อนนักพัฒนา งานเหล่านี้เป็นเวทีให้ผมได้แบ่งปันความรู้ในขณะที่ได้รับมุมมองใหม่ๆ จากผู้อื่น",
      "sections": {
        "conference": "การประชุมและ Meetup "
      },
      "appearances": {
        "experience": {
          "title": "Experience Stories",
          "description": "แบ่งปันประสบการณ์การพัฒนาจริงและข้อคิดในการทำงานให้กับนักศึกษาคอมพิวเตอร์ โดยเน้นที่บทเรียนภาคปฏิบัติและการเตรียมตัวสำหรับอาชีพในอุตสาหกรรมซอฟต์แวร์",
          "event": "CSCamp @KMITL"
        },
        "microfrontend": {
          "title": "มาลองดูซิ Micro-frontend เป็นไปได้จริงไหม?",
          "description": "สำรวจความเป็นไปได้และการนำสถาปัตยกรรม Micro-frontend ไปใช้งานจริง พร้อมพูดคุยเกี่ยวกับข้อดี ความท้าทาย และการประยุกต์ใช้ในการพัฒนาเว็บสมัยใหม่",
          "event": "Vue.js Thailand Meetup #4"
        },
        "sentry": {
          "title": "Vue Error Logging to Sentry",
          "description": "สาธิตการติดตามและตรวจสอบข้อผิดพลาดในแอปพลิเคชัน Vue.js โดยใช้ Sentry พร้อมแนวทางการนำไปใช้และแนวปฏิบัติที่ดีสำหรับแอปพลิเคชันที่ใช้งานจริง",
          "event": "Vue.js Thailand Meetup #5"
        },
        "typescript": {
          "title": "Vue.js with TypeScript",
          "description": "แบ่งปันความรู้เกี่ยวกับการใช้ TypeScript ร่วมกับ Vue.js เน้นประโยชน์ด้านความปลอดภัยของ type การปรับปรุงขั้นตอนการพัฒนา และเทคนิคการนำไปใช้งานจริง",
          "event": "TypeScript Thailand Meetup #1"
        }
      }
    },
    "articles": {
      "title": "บทความเกี่ยวกับการพัฒนาซอฟต์แวร์ สถาปัตยกรรมระบบ และประสบการณ์ด้านเทคโนโลยี",
      "intro": "รวบรวมความคิดทั้งหมดของผมเกี่ยวกับการพัฒนาแบบฟูลสแต็ก การทำ DevOps และประสบการณ์ด้านวิศวกรรมซอฟต์แวร์ เรียงตามลำดับเวลา",
      "read": "อ่านบทความ",
      "min_read": "นาทีในการอ่าน"
    },
    "about": {
      "title": "ผมภาสกร เป็น Full Stack Engineer และ Software Developer",
      "intro": {
        "p1": "ด้วยประสบการณ์กว่า 6 ปีในการพัฒนาซอฟต์แวร์ ผมได้พัฒนาตัวเองจากนักพัฒนาซอฟแวร์สู่ผู้เชี่ยวชาญด้านเทคนิคที่เชื่อมช่องว่างระหว่างระบบ Backend ที่ซับซ้อนกับประสบการณ์ผู้ใช้ที่เข้าใจง่าย การเดินทางของผมขับเคลื่อนด้วยความต้องการที่จะเรียนรู้และเชี่ยวชาญเทคโนโลยีใหม่ๆ อยู่เสมอ",
        "p2": "ปัจจุบันผมทำงานเป็นผู้เชี่ยวชาญด้านเทคนิคที่ Finema ที่ซึ่งผมพัฒนาโซลูชันระดับองค์กรและนำการพัฒนาด้านเทคนิค บทบาทของผมเกี่ยวข้องกับการออกแบบระบบที่สามารถ scale ได้ การพัฒนาไลบรารี่หลัก และการสร้างแนวทางการพัฒนาที่แข็งแกร่ง"
      },
      "whatIDo": {
        "title": "สิ่งที่ผมทำ",
        "intro": "ผมเชี่ยวชาญในการสร้างแอปพลิเคชันแบบ Full Stack โดยเน้นที่:",
        "skills": {
          "backend": "พัฒนา Backend ที่ scale ได้โดยใช้ Golang และสถาปัตยกรรมไมโครเซอร์วิส",
          "frontend": "สร้างแอปพลิเคชัน Frontend ที่ตอบสนองและมีประสิทธิภาพด้วย Vue.js และ Nuxt.js",
          "devops": "นำแนวทาง DevOps มาใช้ด้วย Docker, Kubernetes และระบบ CI/CD",
          "database": "ออกแบบและปรับปรุงโครงสร้างฐานข้อมูลและการค้นหาข้อมูล",
          "leadership": "นำการพัฒนาด้านเทคนิคและเป็นพี่เลี้ยงให้สมาชิกในทีม"
        }
      },
      "beyondCoding": {
        "title": "นอกเหนือจากการเขียนโค้ด",
        "content": "ผมเชื่อในการเรียนรู้อย่างต่อเนื่องและการแบ่งปันความรู้กับชุมชนนักพัฒนา เมื่อไม่ได้เขียนโค้ด ผมชอบสำรวจเทคโนโลยีใหม่ๆ มีส่วนร่วมในโปรเจกต์โอเพนซอร์ส และติดตามแนวโน้มล่าสุดในอุตสาหกรรม"
      },
      "quote": "\"คุณไม่ได้ไม่เก่ง คุณแค่ยังไม่ฝึก\" - ปรัชญานี้ขับเคลื่อนแนวทางของผมทั้งในการพัฒนาตนเองและการพัฒนาทีม",
      "connect": {
        "title": "มาพุดคุยกัน",
        "content": "ผมสนใจที่จะพูดคุยเกี่ยวกับโอกาสใหม่ๆ ความท้าทายทางเทคนิค หรือแค่พูดคุยกับเพื่อนนักพัฒนา อย่าลังเลที่จะติดต่อผมผ่าน"
      },
      "social": {
        "facebook": "ติดตามบน Facebook",
        "instagram": "ติดตามบน Instagram",
        "github": "ติดตามบน GitHub",
        "linkedin": "ติดตามบน LinkedIn"
      }
    },
    "menu": {
      "home": "หน้าแรก",
      "about": "เกี่ยวกับ",
      "articles": "บทความ",
      "projects": "ผลงาน",
      "speaking": "บรรยาย",
      "uses": "เครื่องมือ"
    }
  }
}
